---
kind: method
id: M:Autodesk.Revit.DB.Toposolid.GetSubDivisionIds
source: html/0a8cf5c3-61c8-b255-06e7-bb42a9097788.htm
---
# Autodesk.Revit.DB.Toposolid.GetSubDivisionIds Method

Get all element ids of toposolid subdivisions with the current toposolid as its host.

## Syntax (C#)
```csharp
public IList<ElementId> GetSubDivisionIds()
```

## Returns
The array of toposolid subdivision ids.